In [1]:
import pandas as pd

In [9]:
data = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
    'Age': [20, 22, 19, 21, 20],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female'],
    'Marks': [85, 78, 92, 74, 88]
})

In [14]:
data

    Name   Age  Gender  Marks
0  Alice  20.0  Female  85.00
1    Bob  22.0    Male  84.75
2  Carol  19.0  Female  92.00
3  David  21.0    Male  74.00
4    Eve   NaN  Female  88.00

1. Modify the DataFrame from Task 2 by introducing missing values:

In [10]:
data.loc[1, 'Marks'] = None
data.loc[4, 'Age'] = None

2. Write a Python program to:

A. Identify missing values in the DataFrame.

In [11]:
data.isnull()

    Name    Age  Gender  Marks
0  False  False   False  False
1  False  False   False   True
2  False  False   False  False
3  False  False   False  False
4  False   True   False  False

B. Fill missing values in the Marks column with the column's
mean.

In [13]:

data['Marks'].fillna(data['Marks'].mean())

0    85.00
1    84.75
2    92.00
3    74.00
4    88.00
Name: Marks, dtype: float64

C. Drop rows where the Age column has missing values.

In [16]:
data.dropna(subset=['Age'])

    Name   Age  Gender  Marks
0  Alice  20.0  Female  85.00
1    Bob  22.0    Male  84.75
2  Carol  19.0  Female  92.00
3  David  21.0    Male  74.00